src/cf/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ПоступлениеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ВыплатаЗарплаты</basedOn>
  <basedOn>Document.ПлатёжнаяВедомостьНаАванс</basedOn>
  <basedOn>Document.ВозвратОтПокупателя</basedOn>
  <basedOn>Document.ПрочиеРасходы</basedOn>
  <basedOn>Document.НалоговаяНакладнаяПокупка</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоcтавщикамиНалоговый</registerRecords>
  <attributes>
    <name>Выдать</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДляПечати</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВыплатаЗарплаты</types>
      <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
      <types>DocumentRef.ВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ВыплатаЗарплаты</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеРасходы</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
        <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ДенежныеСредстваОрганизаций/ДенежныеСредстваОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваОрганизаций</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУчет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПрочиеРасходы</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДвижения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДвиженияПоКассе/ДвиженияПоКассе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияПоКассе</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипыДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Убытки/Убытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Убытки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ОплатыЧеками/ОплатыЧеками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОплатыЧеками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПокупателямиНалоговый/ВзаиморасчётыСПокупателямиНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПокупателямиНалоговый</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНалоговые</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/РасходныйКассовыйОрдер/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладная") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();
		Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладная") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда	
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;	
		Иначе	
			ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДанныеЗаполнения.ХозяйственнаяОперация);
		КонецЕсли;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		Основание = ДанныеЗаполнения;
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения.Основание);
		Если Не ТЧОснования.Количество() = 0 Тогда 
			ТЧОснования.Получить(0).Сумма = Сумма;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ДанныеЗаполнения.Свойство("ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			Заявка = ДанныеЗаполнения.ЗаявкаНаРасходованиеДенежныхСредств;
			ЗаявкаНаРасходованиеДенежныхСредств = Заявка;
			Организация = Заявка.Организация;
			Контрагент = Заявка.Контрагент;
			ХозяйственнаяОперация = Заявка.ХозяйственнаяОперация; 
			Дата = Заявка.ДатаПлатежа;
			Касса = Заявка.МестоХранения;
			Кассир = ПараметрыСеанса.Пользователь;
			Сумма = Заявка.Сумма;
			Для Каждого Стр Из Заявка.ТЧОснования Цикл
				НС = ТЧОснования.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
			КонецЦикла;
		Иначе
			ДокЗаполнения = ДанныеЗаполнения.Документ;
			ТипОплаты = ?(ДанныеЗаполнения.Свойство("ТипОплаты"), ДанныеЗаполнения.ТипОплаты, Справочники.TypesDePayment.Cash);
			Организация = ДокЗаполнения.Организация;
			ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
			//Касса = ДанныеОрганизации.Касса;
			КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
			Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
			Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
			Контрагент = ДокЗаполнения.Контрагент;
			Договор = ДокЗаполнения.Договор;
			Если ТипЗнч(ДокЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
			Иначе	
				ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДокЗаполнения.ХозяйственнаяОперация);			
			КонецЕсли;
			Сумма = ДанныеЗаполнения.Сумма;
			РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДокЗаполнения);
			Если Не ТЧОснования.Количество() = 0 Тогда 
				СтрТЧОснования = ТЧОснования.Получить(0);
				СтрТЧОснования.Сумма = Сумма;
				РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(СтрТЧОснования);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыплатаЗарплаты")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПлатёжнаяВедомостьНаАванс") Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты;
		Организация = ПараметрыСеанса.ПараметрыПользователя.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		Касса = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Основание = ДанныеЗаполнения;
		Сумма = ДанныеЗаполнения.Сумма-ДенежныеСредства.ПолучитьОстатокВыплатыЗПОснованию(ДанныеЗаполнения,Истина);
		СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗарплаты;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочиеРасходы") Тогда 
		ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		Касса = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Сумма = ДанныеЗаполнения.Сумма;
		СтатьяДДС = ДанныеЗаполнения.СтатьяДДС;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Иначе
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		//Касса = ДанныеОрганизации.Касса;
		КассаПользователя = РегистрыСведений.НастройкиПользователей.КассаПользователя();	
		Касса = ?(КассаПользователя.Владелец = Организация, КассаПользователя, ДанныеОрганизации.Касса);
		МестоХранения = Касса.МестоХранения;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтатьяДДС) Тогда 
		СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(ХозяйственнаяОперация);
	КонецЕсли;
	КассоваяСмена = РаботаСДокументами.НайтиОткрытуюСмену(Касса);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	Блокировка.Заблокировать();
	// Формируем движения
	РегистрыНакопления.ДенежныеСредстваОрганизаций.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ДвиженияПоКассе.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Зарплата.СформироватьДвижения(ЭтотОбъект);	
	РегистрыНакопления.ОплатыЧеками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателямиНалоговый.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоcтавщикамиНалоговый.СформироватьДвижения(ЭтотОбъект);
	// Записываем движения
	Движения.Записать();
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения документа, затронувшего заказы клиента на производство: блокировки в порядке проведения,
// очистка движений и пересчёт стадий заказов (E8). Без таких заказов движения удаляет платформа, как раньше.
//
// Параметры:
//  Отказ - Булево - не используется.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Блокировка);
КонецПроцедуры

// Блокировки проведения и отмены проведения - один набор в одном порядке (E8).
//
// Параметры:
//  Блокировка - БлокировкаДанных - заполняемая блокировка.
//
Процедура ЗаполнитьБлокировкуПроведения(Блокировка)
	Если ЗначениеЗаполнено(Контрагент) и ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//УправляемыеБлокировки.ВзаиморасчётыСКонтрагентамиПрочее(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПоставщиками(Блокировка, Контрагент);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
	КассоваяСмена = РаботаСДокументами.НайтиОткрытуюСмену(Касса);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Если Не Отказ Тогда
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты И ЗначениеЗаполнено(Основание))
		или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочийРасходДенежныхСредств Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
	КонецЕсли;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочийРасходДенежныхСредств Тогда 
		ПроверяемыеРеквизиты.Добавить("Комментарий");
	КонецЕсли;
	Если ТипОплаты = Справочники.TypesDePayment.Cheque Тогда 
		ПроверяемыеРеквизиты.Добавить("Чек");
	КонецЕсли;
КонецПроцедуры
